In [56]:
import pandas as pd
import numpy as np

In [58]:
data = np.random.randn(4,3)

In [59]:
data

array([[-0.5656968 ,  0.27319502, -0.01623776],
       [-1.72084042,  0.93340631,  1.65460727],
       [ 0.20007795, -0.95990502,  0.64328511],
       [-0.8233641 ,  0.68689388,  0.91441553]])

In [60]:
dataFrame = pd.DataFrame(data)

In [61]:
dataFrame

          0         1         2
0 -0.565697  0.273195 -0.016238
1 -1.720840  0.933406  1.654607
2  0.200078 -0.959905  0.643285
3 -0.823364  0.686894  0.914416

In [105]:
dataFrame[0]

0   -0.565697
1   -1.720840
2    0.200078
3   -0.823364
Name: 0, dtype: float64

In [106]:
yeniDataFrame = pd.DataFrame(data, index = ["Atıl","Zeynep","Atlas","Mehmet"], columns = ["Maas","Yas","Calısma Saati"])

In [107]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [108]:
yeniDataFrame["Yas"]

Atıl      0.273195
Zeynep    0.933406
Atlas    -0.959905
Mehmet    0.686894
Name: Yas, dtype: float64

In [109]:
yeniDataFrame["Calısma Saati"]

Atıl     -0.016238
Zeynep    1.654607
Atlas     0.643285
Mehmet    0.914416
Name: Calısma Saati, dtype: float64

In [110]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atıl   -0.565697  0.273195
Zeynep -1.720840  0.933406
Atlas   0.200078 -0.959905
Mehmet -0.823364  0.686894

In [111]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [112]:
yeniDataFrame.loc["Atıl"]

Maas            -0.565697
Yas              0.273195
Calısma Saati   -0.016238
Name: Atıl, dtype: float64

In [113]:
yeniDataFrame.loc["Zeynep"]

Maas            -1.720840
Yas              0.933406
Calısma Saati    1.654607
Name: Zeynep, dtype: float64

In [114]:
yeniDataFrame.iloc[1]

Maas            -1.720840
Yas              0.933406
Calısma Saati    1.654607
Name: Zeynep, dtype: float64

In [115]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [116]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [117]:
yeniDataFrame

            Maas       Yas  Calısma Saati  Emeklilik Yaşı
Atıl   -0.565697  0.273195      -0.016238        0.546390
Zeynep -1.720840  0.933406       1.654607        1.866813
Atlas   0.200078 -0.959905       0.643285       -1.919810
Mehmet -0.823364  0.686894       0.914416        1.373788

In [118]:
yeniDataFrame.drop("Emeklilik Yaşı",axis = 1)

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [119]:
yeniDataFrame.drop("Mehmet", axis = 0)

            Maas       Yas  Calısma Saati  Emeklilik Yaşı
Atıl   -0.565697  0.273195      -0.016238        0.546390
Zeynep -1.720840  0.933406       1.654607        1.866813
Atlas   0.200078 -0.959905       0.643285       -1.919810

In [120]:
yeniDataFrame

            Maas       Yas  Calısma Saati  Emeklilik Yaşı
Atıl   -0.565697  0.273195      -0.016238        0.546390
Zeynep -1.720840  0.933406       1.654607        1.866813
Atlas   0.200078 -0.959905       0.643285       -1.919810
Mehmet -0.823364  0.686894       0.914416        1.373788

In [121]:
yeniDataFrame.drop("Emeklilik Yaşı",axis = 1, inplace=True)

In [122]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [123]:
yeniDataFrame.loc["Atıl"]["Yas"]

0.2731950183265147

In [124]:
yeniDataFrame.loc["Atlas","Yas"]

-0.9599050246447194

In [125]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [126]:
yeniDataFrame < 0

         Maas    Yas  Calısma Saati
Atıl     True  False           True
Zeynep   True  False          False
Atlas   False   True          False
Mehmet   True  False          False

In [127]:
booleanFrame = yeniDataFrame < 0

In [128]:
booleanFrame

         Maas    Yas  Calısma Saati
Atıl     True  False           True
Zeynep   True  False          False
Atlas   False   True          False
Mehmet   True  False          False

In [129]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [130]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calısma Saati
Atıl   -0.565697       NaN      -0.016238
Zeynep -1.720840       NaN            NaN
Atlas        NaN -0.959905            NaN
Mehmet -0.823364       NaN            NaN

In [131]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calısma Saati
Atıl   -0.565697       NaN      -0.016238
Zeynep -1.720840       NaN            NaN
Atlas        NaN -0.959905            NaN
Mehmet -0.823364       NaN            NaN

In [132]:
 yeniDataFrame[yeniDataFrame["Yas"] > 0]

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Mehmet -0.823364  0.686894       0.914416

In [133]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [134]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calısma Saati
0    Atıl -0.565697  0.273195      -0.016238
1  Zeynep -1.720840  0.933406       1.654607
2   Atlas  0.200078 -0.959905       0.643285
3  Mehmet -0.823364  0.686894       0.914416

In [135]:
yeniDataFrame

            Maas       Yas  Calısma Saati
Atıl   -0.565697  0.273195      -0.016238
Zeynep -1.720840  0.933406       1.654607
Atlas   0.200078 -0.959905       0.643285
Mehmet -0.823364  0.686894       0.914416

In [136]:
yeniIndexListesi = ["Ati" , "Zey", "Atl", "Meh"]

In [137]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [138]:
yeniDataFrame

            Maas       Yas  Calısma Saati Yeni Index
Atıl   -0.565697  0.273195      -0.016238        Ati
Zeynep -1.720840  0.933406       1.654607        Zey
Atlas   0.200078 -0.959905       0.643285        Atl
Mehmet -0.823364  0.686894       0.914416        Meh

In [139]:
yeniDataFrame.set_index("Yeni Index")

                Maas       Yas  Calısma Saati
Yeni Index
Ati        -0.565697  0.273195      -0.016238
Zey        -1.720840  0.933406       1.654607
Atl         0.200078 -0.959905       0.643285
Meh        -0.823364  0.686894       0.914416

In [140]:
yeniDataFrame

            Maas       Yas  Calısma Saati Yeni Index
Atıl   -0.565697  0.273195      -0.016238        Ati
Zeynep -1.720840  0.933406       1.654607        Zey
Atlas   0.200078 -0.959905       0.643285        Atl
Mehmet -0.823364  0.686894       0.914416        Meh

In [141]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [142]:
yeniDataFrame

                Maas       Yas  Calısma Saati
Yeni Index
Ati        -0.565697  0.273195      -0.016238
Zey        -1.720840  0.933406       1.654607
Atl         0.200078 -0.959905       0.643285
Meh        -0.823364  0.686894       0.914416

In [143]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [144]:
icIndexler = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [145]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))

In [146]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [148]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [150]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [151]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [152]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [155]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndex,columns=["Yas","Meslek"])

In [156]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [157]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [158]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [159]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [161]:
cizgiFilmDataFrame.index.names = ["Film Adı" , "İsim"]

In [162]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F